In [6]:
import pandas as pd 
dogs = pd.read_csv("dogs_data.csv")

## Detecting missing values

In [7]:
dogs.isna()

    name  breed  color  height_cm  weight_kg  date_of_birth
0  False  False  False      False      False          False
1  False  False  False      False      False          False
2  False  False  False      False      False          False
3  False  False  False      False      False          False
4  False  False  False      False      False          False
5  False  False  False      False      False          False
6  False  False  False      False      False          False

##  Detecting any missing values

In [8]:
dogs.isna().any()

name             False
breed            False
color            False
height_cm        False
weight_kg        False
date_of_birth    False
dtype: bool

## Counting missing values

In [9]:
dogs.isna().sum()

name             0
breed            0
color            0
height_cm        0
weight_kg        0
date_of_birth    0
dtype: int64

## Removing missing values

In [10]:
dogs.dropna()

      name        breed  color  height_cm  weight_kg date_of_birth
0    Bella     Labrador  Brown         56         24    2013-07-01
1  Charlie       Poodle  Black         43         24    2016-09-16
2     Lucy    Chow Chow  Brown         46         24    2014-08-25
3   Cooper    Schnauzer   Gray         49         17    2011-12-11
4      Max     Labrador  Black         59         29    2017-01-20
5   Stella    Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St. Bernard  White         77         74    2018-02-27

## Replacing missing values

In [11]:
dogs.fillna(0)

      name        breed  color  height_cm  weight_kg date_of_birth
0    Bella     Labrador  Brown         56         24    2013-07-01
1  Charlie       Poodle  Black         43         24    2016-09-16
2     Lucy    Chow Chow  Brown         46         24    2014-08-25
3   Cooper    Schnauzer   Gray         49         17    2011-12-11
4      Max     Labrador  Black         59         29    2017-01-20
5   Stella    Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St. Bernard  White         77         74    2018-02-27